app/services/aluno_importer_service.rb

  def processar_dados(turmas_data)
    erros = []

    turmas_data.each_with_index do |turma_info, index|
      disciplina = Disciplina.find_by(codigo: turma_info["code"])
      unless disciplina
        erros << "Turma #{index + 1}: Disciplina #{turma_info['code']} não encontrada."
        next
      end

      turma = disciplina.turmas.find_by(codigo_turma: turma_info["classCode"], semestre: turma_info["semester"])
---
SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = ? LIMIT ?  [["codigo", "CIC0097"], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = ? AND "turmas"."codigo_turma" = ? AND "turmas"."semestre" = ? LIMIT ?  [["disciplina_id", 1], ["codigo_turma", "TA"], ["semestre", "2021.2"], ["LIMIT", 1]]

  def processar_docente(docente_info, turma, index, erros)
    return unless docente_info.present?

    professor = Usuario.find_or_initialize_by(matricula: docente_info["usuario"])
    if professor.new_record?
      professor.assign_attributes(
        nome: docente_info["nome"],
        email: docente_info["email"],
        password: SecureRandom.urlsafe_base64(20) + "Aa!2"
      )
      professor.save!
      professor.send_reset_password_instructions
      @novos_docentes += 1
    end
    turma.update!(professor: professor)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."matricula" = ? LIMIT ?  [["matricula", "83807519491"], ["LIMIT", 1]]
UPDATE "usuarios" SET "updated_at" = ?, "reset_password_token" = ?, "reset_password_sent_at" = ? WHERE "usuarios"."id" = ?  [["updated_at", "2025-07-22 04:55:21.295753"], ["reset_password_token", "[FILTERED]"], ["reset_password_sent_at", "[FILTERED]"], ["id", 4]]
UPDATE "turmas" SET "professor_id" = ?, "updated_at" = ? WHERE "turmas"."id" = ?  [["professor_id", 4], ["updated_at", "2025-07-22 04:55:26.489341"], ["id", 1]]

  def processar_discentes(discentes_info, turma, index, erros)
    return unless discentes_info.present?

    discentes_info.each_with_index do |aluno_info, aluno_index|
      aluno = Usuario.find_or_initialize_by(matricula: aluno_info["matricula"])
      if aluno.new_record?
        aluno.assign_attributes(
          nome: aluno_info["nome"],
          email: aluno_info["email"],
          password: SecureRandom.urlsafe_base64(20) + "Aa!2"
        )
        aluno.save!
        aluno.send_reset_password_instructions
        @novos_alunos += 1
      end
      turma.usuarios << aluno unless turma.usuarios.include?(aluno)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."matricula" = ? LIMIT ?  [["matricula", "190084006"], ["LIMIT", 1]]
UPDATE "usuarios" SET "updated_at" = ?, "reset_password_token" = ?, "reset_password_sent_at" = ? WHERE "usuarios"."id" = ?  [["updated_at", "2025-07-22 04:55:26.675715"], ["reset_password_token", "[FILTERED]"], ["reset_password_sent_at", "[FILTERED]"], ["id", 5]]
INSERT INTO "usuarios" ("matricula", "nome", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT 1 AS one FROM "usuarios" INNER JOIN "turmas_usuarios" ON "usuarios"."id" = "turmas_usuarios"."usuario_id" WHERE "turmas_usuarios"."turma_id" = ? AND "usuarios"."id" = ? LIMIT ?  [["turma_id", 1], ["id", 5], ["LIMIT", 1]]