app/services/turma_importer_service.rb

INSERT INTO "disciplinas" ("codigo", "nome", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["codigo", "CIC0097"], ["nome", "BANCOS DE DADOS"], ["descricao", nil], ["created_at", "2025-07-22 05:29:18.761395"], ["updated_at", "2025-07-22 05:29:18.761395"]]
SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = ? LIMIT ?  [["codigo", "CIC0097"], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = ? AND "turmas"."codigo_turma" = ? AND "turmas"."semestre" = ? LIMIT ?  [["disciplina_id", 1], ["codigo_turma", "TA"], ["semestre", "2021.2"], ["LIMIT", 1]]
INSERT INTO "turmas" ("codigo_turma", "semestre", "horario", "disciplina_id", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def processar_dados(turmas_data)
    turmas_data.each_with_index do |turma_info, index|
      begin
        # Encontra ou cria a disciplina associada
        disciplina = Disciplina.find_or_create_by!(codigo: turma_info["code"]) do |d|
          d.nome = turma_info["name"]
        end

        class_info = turma_info["class"]
        unless class_info
          @erros << "Linha #{index + 1}: Faltam informações da turma (objeto 'class')."
          next
        end

        # Encontra ou inicializa a turma
        turma = Turma.find_or_initialize_by(
          disciplina: disciplina,
          codigo_turma: class_info["classCode"],
          semestre: class_info["semester"]
        )

        # Salva apenas se for um novo registro
        if turma.new_record?
          turma.save!
          @turmas_criadas += 1
        end
      rescue => e
        @erros << "Linha #{index + 1}: #{e.message}"