app/controllers/admin/importacoes_controller.rb

SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = ? LIMIT ?  [["codigo", "CIC0097"], ["LIMIT", 1]]
---
    def importar_turmas
      file = params[:file] || params[:arquivo]

      # 1. Validação inicial: verifica se um ficheiro foi enviado
      unless file
        render json: { alert: "Nenhum ficheiro foi enviado." }, status: :bad_request
        return
      end

      # 2. Lê e analisa o ficheiro JSON
      begin
        turmas_data = JSON.parse(file.read)
      rescue JSON::ParserError
        render json: { alert: "Erro: O ficheiro não é um JSON válido." }, status: :unprocessable_entity
        return
      end

      # 3. Processa cada item do JSON para criar as turmas
      erros = []
      turmas_criadas = 0

      turmas_data.each_with_index do |turma_info, index|
        begin
          # --- CÓDIGO ATUALIZADO PARA O SEU JSON ---
          # Encontra ou cria a disciplina associada
          disciplina = Disciplina.find_or_create_by!(codigo: turma_info["code"]) do |d|

SELECT 1 AS one FROM "usuarios" WHERE "usuarios"."email" = ? LIMIT ?  [["email", "83807519491@mailinator.com"], ["LIMIT", 1]]
---
          end

          # Encontra o professor pelo e-mail (opcional, não será encontrado no seu JSON de exemplo)
          professor = Usuario.find_by(email: turma_info["professor_email"]) if turma_info["professor_email"].present?

SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = ? LIMIT ?  [["codigo", "CIC0097"], ["LIMIT", 1]]
SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = ? AND "turmas"."codigo_turma" = ? AND "turmas"."semestre" = ? LIMIT ?  [["disciplina_id", 1], ["codigo_turma", "TA"], ["semestre", "2021.2"], ["LIMIT", 1]]
---
    def importar_alunos
      file = params[:file] || params[:arquivo]

      unless file
        return render json: { alert: "Nenhum ficheiro foi enviado." }, status: :bad_request
      end

      begin
        alunos_data = JSON.parse(file.read)
      rescue JSON::ParserError
        return render json: { alert: "Erro: O ficheiro não é um JSON válido." }, status: :unprocessable_entity
      end

      erros = []
      alunos_criados_ou_atualizados = 0

      # Processa cada turma no JSON
      alunos_data.each_with_index do |turma_data, turma_index|
        # Extrai informações da turma
        codigo_disciplina = turma_data["code"]
        codigo_turma = turma_data["classCode"]
        semestre = turma_data["semester"]

        # Encontra ou cria a disciplina
        disciplina = Disciplina.find_or_create_by(codigo: codigo_disciplina) do |d|
          d.nome = "Disciplina #{codigo_disciplina}" # nome padrão se não existir
        end

        # Encontra ou cria a turma
        turma = disciplina.turmas.find_or_create_by!(
          codigo_turma: codigo_turma,
          semestre: semestre
        )

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."matricula" = ? LIMIT ?  [["matricula", "123456789"], ["LIMIT", 1]]
---
        dicentes.each_with_index do |aluno_info, aluno_index|
          begin
            # Encontra o aluno pela matrícula ou cria um novo
            aluno = Usuario.find_or_initialize_by(matricula: aluno_info["matricula"])