app/controllers/admin/importacoes_controller.rb

    def importar_turmas
      file = params[:file] || params[:arquivo]

      # 1. Validação inicial: verifica se um ficheiro foi enviado
      unless file
        render json: { alert: "Nenhum ficheiro foi enviado." }, status: :bad_request
        return
      end

      # 2. Lê e analisa o ficheiro JSON
      begin
        turmas_data = JSON.parse(file.read)
      rescue JSON::ParserError
        render json: { alert: "Erro: O ficheiro não é um JSON válido." }, status: :unprocessable_entity
        return
      end

      # 3. Processa cada item do JSON para criar as turmas
      erros = []
      turmas_criadas = 0

      turmas_data.each_with_index do |turma_info, index|
        begin
          # --- CÓDIGO ATUALIZADO PARA O SEU JSON ---
          # Encontra ou cria a disciplina associada
          disciplina = Disciplina.find_or_create_by!(codigo: turma_info["code"]) do |d|
---
INSERT INTO "turmas" ("codigo_turma", "semestre", "horario", "disciplina_id", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "disciplinas" ("codigo", "nome", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["codigo", "CIC0097"], ["nome", "BANCOS DE DADOS"], ["descricao", nil], ["created_at", "2025-07-22 01:48:24.629238"], ["updated_at", "2025-07-22 01:48:24.629238"]]
SELECT "disciplinas".* FROM "disciplinas" WHERE "disciplinas"."codigo" = ? LIMIT ?  [["codigo", "CIC0097"], ["LIMIT", 1]]

          professor = Usuario.find_by(email: turma_info["professor_email"]) if turma_info["professor_email"].present?

          # Cria a turma, evitando duplicados
          turma = Turma.find_or_initialize_by(
            disciplina: disciplina,
            codigo_turma: class_info["classCode"],
            semestre: class_info["semester"]
          )
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."disciplina_id" = ? AND "turmas"."codigo_turma" = ? AND "turmas"."semestre" = ? LIMIT ?  [["disciplina_id", 1], ["codigo_turma", "TA"], ["semestre", "2021.2"], ["LIMIT", 1]]

          # Se for uma turma nova, associa o professor
          if turma.new_record?
            turma.professor = professor
            turma.save!
---
INSERT INTO "turmas" ("codigo_turma", "semestre", "horario", "disciplina_id", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"