app/controllers/api/v1/passwords_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE (lower(email) = 'cauakamuratt@gmail.com' OR lower(matricula) = 'cauakamuratt@gmail.com') ORDER BY "usuarios"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def forgot
    # Busca o usuário pelo e-mail ou matrícula, ignorando se é maiúscula ou minúscula
    user = Usuario.where("lower(email) = :value OR lower(matricula) = :value", { value: params[:login].to_s.downcase }).first