app/controllers/api/v1/templates_controller.rb

SELECT "templates".* FROM "templates" ORDER BY "templates"."created_at" DESC
---
      def index
        templates = Template.order(created_at: :desc)

INSERT INTO "templates" ("titulo", "criador_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["titulo", "adawdsd"], ["criador_id", 5], ["created_at", "2025-07-20 19:19:55.498023"], ["updated_at", "2025-07-20 19:19:55.498023"]]
SELECT "templates".* FROM "templates" ORDER BY "templates"."created_at" DESC
---
      def create
        @template = Template.new(template_params.merge(criador_id: current_usuario.id))
        if @template.save
          render json: { mensagem: "Template '#{@template.titulo}' salvo com sucesso", template: @template }, status: :created
        else
          render json: { erro: @template.errors.full_messages.join(", ") }, status: :unprocessable_entity

UPDATE "templates" SET "titulo" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["titulo", "a"], ["updated_at", "2025-07-20 19:20:19.711592"], ["id", 17]]
SELECT "templates".* FROM "templates"
---
      def update
        if @template.update(template_params)
          render json: { mensagem: "Template '#{@template.titulo}' atualizado com sucesso", template: @template }, status: :ok
        else
          render json: { erro: @template.errors.full_messages.join(", ") }, status: :unprocessable_entity

DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 17]]
---
      def destroy
        if @template.destroy

SELECT "templates".* FROM "templates" WHERE "templates"."id" = 1 LIMIT 1
---
      def set_template
        @template = Template.find(params[:id])