app/models/template.rb

  validate :questoes_presentes, unless: :skip_questoes_validation

  # MODIFICADO: Ajuste no reject_if para lidar melhor com _destroy
  accepts_nested_attributes_for :questoes, allow_destroy: true, reject_if: proc { |attributes| attributes['id'].blank? && attributes['enunciado'].blank? && attributes['tipo'].blank? }
---
SELECT "questoes".* FROM "questoes" WHERE "questoes"."template_id" = 14