app/models/usuario.rb

  def formularios_pendentes
    return Formulario.none if self.turmas.empty?

    formularios_das_turmas = Formulario.joins(:turmas)
                                       .where(turmas: { id: self.turmas.pluck(:id) })
                                       # Adiciona a condição para o prazo:
                                       # O prazo deve ser NULO (sem prazo) OU estar no futuro.
                                       .where("formularios.prazo IS NULL OR formularios.prazo > ?", Time.current)
                                       .distinct

    formularios_respondidos_ids = self.resposta_formularios.pluck(:formulario_id)
    formularios_das_turmas.where.not(id: formularios_respondidos_ids)
---
SELECT "usuarios".* FROM "usuarios" WHERE (lower(email) = 'admin@meusistema.com' OR lower(matricula) = 'admin@meusistema.com') ORDER BY "usuarios"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "usuarios".* FROM "usuarios" WHERE (lower(email) = '98765' OR lower(matricula) = '98765') ORDER BY "usuarios"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def self.jwt_revoked?(payload, user); jti_revoked?(payload['jti']); end
  end

  self.jwt_revocation_strategy = NullDenylist

  validates :password, password_complexity: true, if: -> { new_record? || password.present? }
---
SELECT "usuarios".* FROM "usuarios" WHERE (lower(email) = 'admin@meusistema.com' OR lower(matricula) = 'admin@meusistema.com') ORDER BY "usuarios"."id" ASC LIMIT ?  [["LIMIT", 1]]